# FloorSlopeExceedsThreshold Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FloorFailures..::..FloorSlopeExceedsThreshold Property
BuiltInFailures..::..FloorFailures Class See Also
---
Thickness of this Floor may be slightly inaccurate due to extreme Shape Editing. Dimensions to this element in sections and details may not accurately indicate the Thickness shown in Type Properties.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FloorSlopeExceedsThreshold { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FloorSlopeExceedsThreshold As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FloorSlopeExceedsThreshold {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FloorFailures Class
Autodesk.Revit.DB Namespace